       *>REDEFINES-DEFINE  UM ARMAZENAMENTO DE DADOS COM DIFERENTE DESCRIÇÃO DE DADOS

       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINICAO.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 WS-DESCRIPTION.
           05 WS-DATE1 VALUE '20140831'.
           10 WS-YEAR PIC X(4). *> O NIVEL 10 INDICAM QUE É UM NÍVEL A BAIXO DA 05, E PEGA OS DADOS DELA, DEIXANDO OS 4 PRIMEIROS DIGITOS PARA O ANO, 2 PARA O MES, E 2 PARA DIA
           10 WS-MONTH PIC X(2).
           10 WS-DATE PIC X(2).
           05 WS-DATE2 REDEFINES WS-DATE1 PIC 9(8). *> O MESMO VALOR DA VARIÁVEL 1 ESTÁ NA 2
       PROCEDURE DIVISION.
           DISPLAY "WS-DATE1 :" WS-DATE1.
           DISPLAY "WS-DATE2 :" WS-DATE2.

           DISPLAY " WS-YEAR :" WS-YEAR.
           DISPLAY " WS-MONTH :" WS-MONTH.
           DISPLAY " WS-DATE :" WS-DATE.


       STOP RUN.
